---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopExtensionMethod
source: html/85c3438b-1946-69a0-fb3b-439109cdd9ef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelTopExtensionMethod Property

"Top Extension Method"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelTopExtensionMethod { get; }
```